MikroElektronika/core_packages/PIC/XC8/def/PIC18LF6390/mcu.h
// Register: LCDCON
#define LCDCON LCDCON
extern volatile unsigned char           LCDCON              __at(0xF59);
#ifndef _LIB_BUILD
asm("LCDCON equ 0F59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LMUX                   :2;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned WERR                   :1;
        unsigned SLPEN                  :1;
        unsigned LCDEN                  :1;
    };
    struct {
        unsigned LMUX0                  :1;
        unsigned LMUX1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned LCDCS0                 :1;
        unsigned LCDCS1                 :1;
        unsigned                        :1;
        unsigned LCDWERR                :1;
        unsigned LCDSLPEN               :1;
    };
} LCDCONbits_t;
extern volatile LCDCONbits_t LCDCONbits __at(0xF59);
// bitfield macros
#define _LCDCON_LMUX_POSN                                   0x0
#define _LCDCON_LMUX_POSITION                               0x0
#define _LCDCON_LMUX_SIZE                                   0x2
#define _LCDCON_LMUX_LENGTH                                 0x2
#define _LCDCON_LMUX_MASK                                   0x3
#define _LCDCON_CS_POSN                                     0x2
#define _LCDCON_CS_POSITION                                 0x2
#define _LCDCON_CS_SIZE                                     0x2
#define _LCDCON_CS_LENGTH                                   0x2
#define _LCDCON_CS_MASK                                     0xC
#define _LCDCON_WERR_POSN                                   0x5
#define _LCDCON_WERR_POSITION                               0x5
#define _LCDCON_WERR_SIZE                                   0x1
#define _LCDCON_WERR_LENGTH                                 0x1
#define _LCDCON_WERR_MASK                                   0x20
#define _LCDCON_SLPEN_POSN                                  0x6
#define _LCDCON_SLPEN_POSITION                              0x6
#define _LCDCON_SLPEN_SIZE                                  0x1
#define _LCDCON_SLPEN_LENGTH                                0x1
#define _LCDCON_SLPEN_MASK                                  0x40
#define _LCDCON_LCDEN_POSN                                  0x7
#define _LCDCON_LCDEN_POSITION                              0x7
#define _LCDCON_LCDEN_SIZE                                  0x1
#define _LCDCON_LCDEN_LENGTH                                0x1
#define _LCDCON_LCDEN_MASK                                  0x80
#define _LCDCON_LMUX0_POSN                                  0x0
#define _LCDCON_LMUX0_POSITION                              0x0
#define _LCDCON_LMUX0_SIZE                                  0x1
#define _LCDCON_LMUX0_LENGTH                                0x1
#define _LCDCON_LMUX0_MASK                                  0x1
#define _LCDCON_LMUX1_POSN                                  0x1
#define _LCDCON_LMUX1_POSITION                              0x1
#define _LCDCON_LMUX1_SIZE                                  0x1
#define _LCDCON_LMUX1_LENGTH                                0x1
#define _LCDCON_LMUX1_MASK                                  0x2
#define _LCDCON_CS0_POSN                                    0x2
#define _LCDCON_CS0_POSITION                                0x2
#define _LCDCON_CS0_SIZE                                    0x1
#define _LCDCON_CS0_LENGTH                                  0x1
#define _LCDCON_CS0_MASK                                    0x4
#define _LCDCON_CS1_POSN                                    0x3
#define _LCDCON_CS1_POSITION                                0x3
#define _LCDCON_CS1_SIZE                                    0x1
#define _LCDCON_CS1_LENGTH                                  0x1
#define _LCDCON_CS1_MASK                                    0x8
#define _LCDCON_LCDCS0_POSN                                 0x2
#define _LCDCON_LCDCS0_POSITION                             0x2
#define _LCDCON_LCDCS0_SIZE                                 0x1
#define _LCDCON_LCDCS0_LENGTH                               0x1
#define _LCDCON_LCDCS0_MASK                                 0x4
#define _LCDCON_LCDCS1_POSN                                 0x3
#define _LCDCON_LCDCS1_POSITION                             0x3
#define _LCDCON_LCDCS1_SIZE                                 0x1
#define _LCDCON_LCDCS1_LENGTH                               0x1
#define _LCDCON_LCDCS1_MASK                                 0x8
#define _LCDCON_LCDWERR_POSN                                0x5
#define _LCDCON_LCDWERR_POSITION                            0x5
#define _LCDCON_LCDWERR_SIZE                                0x1
#define _LCDCON_LCDWERR_LENGTH                              0x1
#define _LCDCON_LCDWERR_MASK                                0x20
#define _LCDCON_LCDSLPEN_POSN                               0x6
#define _LCDCON_LCDSLPEN_POSITION                           0x6
#define _LCDCON_LCDSLPEN_SIZE                               0x1
#define _LCDCON_LCDSLPEN_LENGTH                             0x1
#define _LCDCON_LCDSLPEN_MASK                               0x40

// Register: LCDSE0
#define LCDSE0 LCDSE0
extern volatile unsigned char           LCDSE0              __at(0xF5A);
#ifndef _LIB_BUILD
asm("LCDSE0 equ 0F5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDSE0                 :8;
    };
    struct {
        unsigned SE0                    :1;
        unsigned SE1                    :1;
        unsigned SE2                    :1;
        unsigned SE3                    :1;
        unsigned SE4                    :1;
        unsigned SE5                    :1;
        unsigned SE6                    :1;
        unsigned SE7                    :1;
    };
    struct {
        unsigned SEGEN0                 :1;
        unsigned SEGEN1                 :1;
        unsigned SEGEN2                 :1;
        unsigned SEGEN3                 :1;
        unsigned SEGEN4                 :1;
        unsigned SEGEN5                 :1;
        unsigned SEGEN6                 :1;
        unsigned SEGEN7                 :1;
    };
} LCDSE0bits_t;
